chanakyaRadCae/pl_0_60X60/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// Laminar viscosity
nu              1.43827e-03;

// Thermal expansion coefficient
beta            0.0033;

// Reference temperature
TRef            296;

// Laminar Prandtl number
Pr              0.71;

// Turbulent Prandtl number
Prt             0.1;

rhoRef      1.127;
CpRef       1007;

//added just for to check uility

k               k [1 1 -3 -1 0 0 0] 2.2989;

// ************************************************************************* //
